ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp153axx_cm4.h
/*****************  Bit definition for DDRPERFM_IER register  *****************/
#define DDRPERFM_IER_OVFIE_Pos (0U)
#define DDRPERFM_IER_OVFIE_Msk (0x1U << DDRPERFM_IER_OVFIE_Pos) /*!< 0x00000001 */
#define DDRPERFM_IER_OVFIE     DDRPERFM_IER_OVFIE_Msk           /*!< overflow interrupt enable */

/*****************  Bit definition for DDRPERFM_ISR register  *****************/
#define DDRPERFM_ISR_OVFF_Pos (0U)
#define DDRPERFM_ISR_OVFF_Msk (0x1U << DDRPERFM_ISR_OVFF_Pos) /*!< 0x00000001 */
#define DDRPERFM_ISR_OVFF     DDRPERFM_ISR_OVFF_Msk           /*!< overflow flag */

/*****************  Bit definition for DDRPERFM_ICR register  *****************/
#define DDRPERFM_ICR_OVF_Pos (0U)
#define DDRPERFM_ICR_OVF_Msk (0x1U << DDRPERFM_ICR_OVF_Pos) /*!< 0x00000001 */
#define DDRPERFM_ICR_OVF     DDRPERFM_ICR_OVF_Msk           /*!< overflow flag */

/****************  Bit definition for DDRPERFM_TCNT register  *****************/
#define DDRPERFM_TCNT_CNT_Pos (0U)
#define DDRPERFM_TCNT_CNT_Msk (0xFFFFFFFFU << DDRPERFM_TCNT_CNT_Pos) /*!< 0xFFFFFFFF */
#define DDRPERFM_TCNT_CNT     DDRPERFM_TCNT_CNT_Msk                  /*!< total time, this is number of DDR controller clocks elapsed while DDRPERFM has been running. */
#define DDRPERFM_TCNT_CNT_0   (0x1U << DDRPERFM_TCNT_CNT_Pos)        /*!< 0x00000001 */
#define DDRPERFM_TCNT_CNT_1   (0x2U << DDRPERFM_TCNT_CNT_Pos)        /*!< 0x00000002 */
#define DDRPERFM_TCNT_CNT_2   (0x4U << DDRPERFM_TCNT_CNT_Pos)        /*!< 0x00000004 */
#define DDRPERFM_TCNT_CNT_3   (0x8U << DDRPERFM_TCNT_CNT_Pos)        /*!< 0x00000008 */
#define DDRPERFM_TCNT_CNT_4   (0x10U << DDRPERFM_TCNT_CNT_Pos)       /*!< 0x00000010 */
#define DDRPERFM_TCNT_CNT_5   (0x20U << DDRPERFM_TCNT_CNT_Pos)       /*!< 0x00000020 */
#define DDRPERFM_TCNT_CNT_6   (0x40U << DDRPERFM_TCNT_CNT_Pos)       /*!< 0x00000040 */
#define DDRPERFM_TCNT_CNT_7   (0x80U << DDRPERFM_TCNT_CNT_Pos)       /*!< 0x00000080 */
#define DDRPERFM_TCNT_CNT_8   (0x100U << DDRPERFM_TCNT_CNT_Pos)      /*!< 0x00000100 */
#define DDRPERFM_TCNT_CNT_9   (0x200U << DDRPERFM_TCNT_CNT_Pos)      /*!< 0x00000200 */
#define DDRPERFM_TCNT_CNT_10  (0x400U << DDRPERFM_TCNT_CNT_Pos)      /*!< 0x00000400 */
#define DDRPERFM_TCNT_CNT_11  (0x800U << DDRPERFM_TCNT_CNT_Pos)      /*!< 0x00000800 */
#define DDRPERFM_TCNT_CNT_12  (0x1000U << DDRPERFM_TCNT_CNT_Pos)     /*!< 0x00001000 */
#define DDRPERFM_TCNT_CNT_13  (0x2000U << DDRPERFM_TCNT_CNT_Pos)     /*!< 0x00002000 */
#define DDRPERFM_TCNT_CNT_14  (0x4000U << DDRPERFM_TCNT_CNT_Pos)     /*!< 0x00004000 */
#define DDRPERFM_TCNT_CNT_15  (0x8000U << DDRPERFM_TCNT_CNT_Pos)     /*!< 0x00008000 */
#define DDRPERFM_TCNT_CNT_16  (0x10000U << DDRPERFM_TCNT_CNT_Pos)    /*!< 0x00010000 */
#define DDRPERFM_TCNT_CNT_17  (0x20000U << DDRPERFM_TCNT_CNT_Pos)    /*!< 0x00020000 */
#define DDRPERFM_TCNT_CNT_18  (0x40000U << DDRPERFM_TCNT_CNT_Pos)    /*!< 0x00040000 */
#define DDRPERFM_TCNT_CNT_19  (0x80000U << DDRPERFM_TCNT_CNT_Pos)    /*!< 0x00080000 */
#define DDRPERFM_TCNT_CNT_20  (0x100000U << DDRPERFM_TCNT_CNT_Pos)   /*!< 0x00100000 */
#define DDRPERFM_TCNT_CNT_21  (0x200000U << DDRPERFM_TCNT_CNT_Pos)   /*!< 0x00200000 */
#define DDRPERFM_TCNT_CNT_22  (0x400000U << DDRPERFM_TCNT_CNT_Pos)   /*!< 0x00400000 */
#define DDRPERFM_TCNT_CNT_23  (0x800000U << DDRPERFM_TCNT_CNT_Pos)   /*!< 0x00800000 */
#define DDRPERFM_TCNT_CNT_24  (0x1000000U << DDRPERFM_TCNT_CNT_Pos)  /*!< 0x01000000 */
#define DDRPERFM_TCNT_CNT_25  (0x2000000U << DDRPERFM_TCNT_CNT_Pos)  /*!< 0x02000000 */
#define DDRPERFM_TCNT_CNT_26  (0x4000000U << DDRPERFM_TCNT_CNT_Pos)  /*!< 0x04000000 */
#define DDRPERFM_TCNT_CNT_27  (0x8000000U << DDRPERFM_TCNT_CNT_Pos)  /*!< 0x08000000 */
#define DDRPERFM_TCNT_CNT_28  (0x10000000U << DDRPERFM_TCNT_CNT_Pos) /*!< 0x10000000 */
#define DDRPERFM_TCNT_CNT_29  (0x20000000U << DDRPERFM_TCNT_CNT_Pos) /*!< 0x20000000 */
#define DDRPERFM_TCNT_CNT_30  (0x40000000U << DDRPERFM_TCNT_CNT_Pos) /*!< 0x40000000 */
#define DDRPERFM_TCNT_CNT_31  (0x80000000U << DDRPERFM_TCNT_CNT_Pos) /*!< 0x80000000 */

/****************  Bit definition for DDRPERFM_CNT0 register  *****************/
#define DDRPERFM_CNT0_CNT_Pos (0U)
#define DDRPERFM_CNT0_CNT_Msk (0xFFFFFFFFU << DDRPERFM_CNT0_CNT_Pos) /*!< 0xFFFFFFFF */
#define DDRPERFM_CNT0_CNT     DDRPERFM_CNT0_CNT_Msk                  /*!< event counter value. */
#define DDRPERFM_CNT0_CNT_0   (0x1U << DDRPERFM_CNT0_CNT_Pos)        /*!< 0x00000001 */
#define DDRPERFM_CNT0_CNT_1   (0x2U << DDRPERFM_CNT0_CNT_Pos)        /*!< 0x00000002 */
#define DDRPERFM_CNT0_CNT_2   (0x4U << DDRPERFM_CNT0_CNT_Pos)        /*!< 0x00000004 */
#define DDRPERFM_CNT0_CNT_3   (0x8U << DDRPERFM_CNT0_CNT_Pos)        /*!< 0x00000008 */
#define DDRPERFM_CNT0_CNT_4   (0x10U << DDRPERFM_CNT0_CNT_Pos)       /*!< 0x00000010 */
#define DDRPERFM_CNT0_CNT_5   (0x20U << DDRPERFM_CNT0_CNT_Pos)       /*!< 0x00000020 */
#define DDRPERFM_CNT0_CNT_6   (0x40U << DDRPERFM_CNT0_CNT_Pos)       /*!< 0x00000040 */
#define DDRPERFM_CNT0_CNT_7   (0x80U << DDRPERFM_CNT0_CNT_Pos)       /*!< 0x00000080 */
#define DDRPERFM_CNT0_CNT_8   (0x100U << DDRPERFM_CNT0_CNT_Pos)      /*!< 0x00000100 */
#define DDRPERFM_CNT0_CNT_9   (0x200U << DDRPERFM_CNT0_CNT_Pos)      /*!< 0x00000200 */
#define DDRPERFM_CNT0_CNT_10  (0x400U << DDRPERFM_CNT0_CNT_Pos)      /*!< 0x00000400 */
#define DDRPERFM_CNT0_CNT_11  (0x800U << DDRPERFM_CNT0_CNT_Pos)      /*!< 0x00000800 */
#define DDRPERFM_CNT0_CNT_12  (0x1000U << DDRPERFM_CNT0_CNT_Pos)     /*!< 0x00001000 */
#define DDRPERFM_CNT0_CNT_13  (0x2000U << DDRPERFM_CNT0_CNT_Pos)     /*!< 0x00002000 */
#define DDRPERFM_CNT0_CNT_14  (0x4000U << DDRPERFM_CNT0_CNT_Pos)     /*!< 0x00004000 */
#define DDRPERFM_CNT0_CNT_15  (0x8000U << DDRPERFM_CNT0_CNT_Pos)     /*!< 0x00008000 */
#define DDRPERFM_CNT0_CNT_16  (0x10000U << DDRPERFM_CNT0_CNT_Pos)    /*!< 0x00010000 */
#define DDRPERFM_CNT0_CNT_17  (0x20000U << DDRPERFM_CNT0_CNT_Pos)    /*!< 0x00020000 */
#define DDRPERFM_CNT0_CNT_18  (0x40000U << DDRPERFM_CNT0_CNT_Pos)    /*!< 0x00040000 */
#define DDRPERFM_CNT0_CNT_19  (0x80000U << DDRPERFM_CNT0_CNT_Pos)    /*!< 0x00080000 */
#define DDRPERFM_CNT0_CNT_20  (0x100000U << DDRPERFM_CNT0_CNT_Pos)   /*!< 0x00100000 */
#define DDRPERFM_CNT0_CNT_21  (0x200000U << DDRPERFM_CNT0_CNT_Pos)   /*!< 0x00200000 */
#define DDRPERFM_CNT0_CNT_22  (0x400000U << DDRPERFM_CNT0_CNT_Pos)   /*!< 0x00400000 */
#define DDRPERFM_CNT0_CNT_23  (0x800000U << DDRPERFM_CNT0_CNT_Pos)   /*!< 0x00800000 */
#define DDRPERFM_CNT0_CNT_24  (0x1000000U << DDRPERFM_CNT0_CNT_Pos)  /*!< 0x01000000 */
#define DDRPERFM_CNT0_CNT_25  (0x2000000U << DDRPERFM_CNT0_CNT_Pos)  /*!< 0x02000000 */
#define DDRPERFM_CNT0_CNT_26  (0x4000000U << DDRPERFM_CNT0_CNT_Pos)  /*!< 0x04000000 */
#define DDRPERFM_CNT0_CNT_27  (0x8000000U << DDRPERFM_CNT0_CNT_Pos)  /*!< 0x08000000 */
#define DDRPERFM_CNT0_CNT_28  (0x10000000U << DDRPERFM_CNT0_CNT_Pos) /*!< 0x10000000 */
#define DDRPERFM_CNT0_CNT_29  (0x20000000U << DDRPERFM_CNT0_CNT_Pos) /*!< 0x20000000 */
#define DDRPERFM_CNT0_CNT_30  (0x40000000U << DDRPERFM_CNT0_CNT_Pos) /*!< 0x40000000 */
#define DDRPERFM_CNT0_CNT_31  (0x80000000U << DDRPERFM_CNT0_CNT_Pos) /*!< 0x80000000 */

/****************  Bit definition for DDRPERFM_CNT1 register  *****************/
#define DDRPERFM_CNT1_CNT_Pos (0U)
#define DDRPERFM_CNT1_CNT_Msk (0xFFFFFFFFU << DDRPERFM_CNT1_CNT_Pos) /*!< 0xFFFFFFFF */
#define DDRPERFM_CNT1_CNT     DDRPERFM_CNT1_CNT_Msk                  /*!< event counter value. */
#define DDRPERFM_CNT1_CNT_0   (0x1U << DDRPERFM_CNT1_CNT_Pos)        /*!< 0x00000001 */
#define DDRPERFM_CNT1_CNT_1   (0x2U << DDRPERFM_CNT1_CNT_Pos)        /*!< 0x00000002 */
#define DDRPERFM_CNT1_CNT_2   (0x4U << DDRPERFM_CNT1_CNT_Pos)        /*!< 0x00000004 */
#define DDRPERFM_CNT1_CNT_3   (0x8U << DDRPERFM_CNT1_CNT_Pos)        /*!< 0x00000008 */
#define DDRPERFM_CNT1_CNT_4   (0x10U << DDRPERFM_CNT1_CNT_Pos)       /*!< 0x00000010 */
#define DDRPERFM_CNT1_CNT_5   (0x20U << DDRPERFM_CNT1_CNT_Pos)       /*!< 0x00000020 */
#define DDRPERFM_CNT1_CNT_6   (0x40U << DDRPERFM_CNT1_CNT_Pos)       /*!< 0x00000040 */
#define DDRPERFM_CNT1_CNT_7   (0x80U << DDRPERFM_CNT1_CNT_Pos)       /*!< 0x00000080 */
#define DDRPERFM_CNT1_CNT_8   (0x100U << DDRPERFM_CNT1_CNT_Pos)      /*!< 0x00000100 */
#define DDRPERFM_CNT1_CNT_9   (0x200U << DDRPERFM_CNT1_CNT_Pos)      /*!< 0x00000200 */
#define DDRPERFM_CNT1_CNT_10  (0x400U << DDRPERFM_CNT1_CNT_Pos)      /*!< 0x00000400 */
#define DDRPERFM_CNT1_CNT_11  (0x800U << DDRPERFM_CNT1_CNT_Pos)      /*!< 0x00000800 */
#define DDRPERFM_CNT1_CNT_12  (0x1000U << DDRPERFM_CNT1_CNT_Pos)     /*!< 0x00001000 */
#define DDRPERFM_CNT1_CNT_13  (0x2000U << DDRPERFM_CNT1_CNT_Pos)     /*!< 0x00002000 */
#define DDRPERFM_CNT1_CNT_14  (0x4000U << DDRPERFM_CNT1_CNT_Pos)     /*!< 0x00004000 */
#define DDRPERFM_CNT1_CNT_15  (0x8000U << DDRPERFM_CNT1_CNT_Pos)     /*!< 0x00008000 */
#define DDRPERFM_CNT1_CNT_16  (0x10000U << DDRPERFM_CNT1_CNT_Pos)    /*!< 0x00010000 */
#define DDRPERFM_CNT1_CNT_17  (0x20000U << DDRPERFM_CNT1_CNT_Pos)    /*!< 0x00020000 */
#define DDRPERFM_CNT1_CNT_18  (0x40000U << DDRPERFM_CNT1_CNT_Pos)    /*!< 0x00040000 */
#define DDRPERFM_CNT1_CNT_19  (0x80000U << DDRPERFM_CNT1_CNT_Pos)    /*!< 0x00080000 */
#define DDRPERFM_CNT1_CNT_20  (0x100000U << DDRPERFM_CNT1_CNT_Pos)   /*!< 0x00100000 */
#define DDRPERFM_CNT1_CNT_21  (0x200000U << DDRPERFM_CNT1_CNT_Pos)   /*!< 0x00200000 */
#define DDRPERFM_CNT1_CNT_22  (0x400000U << DDRPERFM_CNT1_CNT_Pos)   /*!< 0x00400000 */
#define DDRPERFM_CNT1_CNT_23  (0x800000U << DDRPERFM_CNT1_CNT_Pos)   /*!< 0x00800000 */
#define DDRPERFM_CNT1_CNT_24  (0x1000000U << DDRPERFM_CNT1_CNT_Pos)  /*!< 0x01000000 */
#define DDRPERFM_CNT1_CNT_25  (0x2000000U << DDRPERFM_CNT1_CNT_Pos)  /*!< 0x02000000 */
#define DDRPERFM_CNT1_CNT_26  (0x4000000U << DDRPERFM_CNT1_CNT_Pos)  /*!< 0x04000000 */
#define DDRPERFM_CNT1_CNT_27  (0x8000000U << DDRPERFM_CNT1_CNT_Pos)  /*!< 0x08000000 */
#define DDRPERFM_CNT1_CNT_28  (0x10000000U << DDRPERFM_CNT1_CNT_Pos) /*!< 0x10000000 */
#define DDRPERFM_CNT1_CNT_29  (0x20000000U << DDRPERFM_CNT1_CNT_Pos) /*!< 0x20000000 */
#define DDRPERFM_CNT1_CNT_30  (0x40000000U << DDRPERFM_CNT1_CNT_Pos) /*!< 0x40000000 */
#define DDRPERFM_CNT1_CNT_31  (0x80000000U << DDRPERFM_CNT1_CNT_Pos) /*!< 0x80000000 */

/****************  Bit definition for DDRPERFM_CNT2 register  *****************/
#define DDRPERFM_CNT2_CNT_Pos (0U)
#define DDRPERFM_CNT2_CNT_Msk (0xFFFFFFFFU << DDRPERFM_CNT2_CNT_Pos) /*!< 0xFFFFFFFF */
#define DDRPERFM_CNT2_CNT     DDRPERFM_CNT2_CNT_Msk                  /*!< event counter value. */
#define DDRPERFM_CNT2_CNT_0   (0x1U << DDRPERFM_CNT2_CNT_Pos)        /*!< 0x00000001 */
#define DDRPERFM_CNT2_CNT_1   (0x2U << DDRPERFM_CNT2_CNT_Pos)        /*!< 0x00000002 */
#define DDRPERFM_CNT2_CNT_2   (0x4U << DDRPERFM_CNT2_CNT_Pos)        /*!< 0x00000004 */
#define DDRPERFM_CNT2_CNT_3   (0x8U << DDRPERFM_CNT2_CNT_Pos)        /*!< 0x00000008 */
#define DDRPERFM_CNT2_CNT_4   (0x10U << DDRPERFM_CNT2_CNT_Pos)       /*!< 0x00000010 */
#define DDRPERFM_CNT2_CNT_5   (0x20U << DDRPERFM_CNT2_CNT_Pos)       /*!< 0x00000020 */
#define DDRPERFM_CNT2_CNT_6   (0x40U << DDRPERFM_CNT2_CNT_Pos)       /*!< 0x00000040 */
#define DDRPERFM_CNT2_CNT_7   (0x80U << DDRPERFM_CNT2_CNT_Pos)       /*!< 0x00000080 */
#define DDRPERFM_CNT2_CNT_8   (0x100U << DDRPERFM_CNT2_CNT_Pos)      /*!< 0x00000100 */
#define DDRPERFM_CNT2_CNT_9   (0x200U << DDRPERFM_CNT2_CNT_Pos)      /*!< 0x00000200 */
#define DDRPERFM_CNT2_CNT_10  (0x400U << DDRPERFM_CNT2_CNT_Pos)      /*!< 0x00000400 */
#define DDRPERFM_CNT2_CNT_11  (0x800U << DDRPERFM_CNT2_CNT_Pos)      /*!< 0x00000800 */
#define DDRPERFM_CNT2_CNT_12  (0x1000U << DDRPERFM_CNT2_CNT_Pos)     /*!< 0x00001000 */
#define DDRPERFM_CNT2_CNT_13  (0x2000U << DDRPERFM_CNT2_CNT_Pos)     /*!< 0x00002000 */
#define DDRPERFM_CNT2_CNT_14  (0x4000U << DDRPERFM_CNT2_CNT_Pos)     /*!< 0x00004000 */
#define DDRPERFM_CNT2_CNT_15  (0x8000U << DDRPERFM_CNT2_CNT_Pos)     /*!< 0x00008000 */
#define DDRPERFM_CNT2_CNT_16  (0x10000U << DDRPERFM_CNT2_CNT_Pos)    /*!< 0x00010000 */
#define DDRPERFM_CNT2_CNT_17  (0x20000U << DDRPERFM_CNT2_CNT_Pos)    /*!< 0x00020000 */
#define DDRPERFM_CNT2_CNT_18  (0x40000U << DDRPERFM_CNT2_CNT_Pos)    /*!< 0x00040000 */
#define DDRPERFM_CNT2_CNT_19  (0x80000U << DDRPERFM_CNT2_CNT_Pos)    /*!< 0x00080000 */
#define DDRPERFM_CNT2_CNT_20  (0x100000U << DDRPERFM_CNT2_CNT_Pos)   /*!< 0x00100000 */
#define DDRPERFM_CNT2_CNT_21  (0x200000U << DDRPERFM_CNT2_CNT_Pos)   /*!< 0x00200000 */
#define DDRPERFM_CNT2_CNT_22  (0x400000U << DDRPERFM_CNT2_CNT_Pos)   /*!< 0x00400000 */
#define DDRPERFM_CNT2_CNT_23  (0x800000U << DDRPERFM_CNT2_CNT_Pos)   /*!< 0x00800000 */
#define DDRPERFM_CNT2_CNT_24  (0x1000000U << DDRPERFM_CNT2_CNT_Pos)  /*!< 0x01000000 */
#define DDRPERFM_CNT2_CNT_25  (0x2000000U << DDRPERFM_CNT2_CNT_Pos)  /*!< 0x02000000 */
#define DDRPERFM_CNT2_CNT_26  (0x4000000U << DDRPERFM_CNT2_CNT_Pos)  /*!< 0x04000000 */
#define DDRPERFM_CNT2_CNT_27  (0x8000000U << DDRPERFM_CNT2_CNT_Pos)  /*!< 0x08000000 */
#define DDRPERFM_CNT2_CNT_28  (0x10000000U << DDRPERFM_CNT2_CNT_Pos) /*!< 0x10000000 */
#define DDRPERFM_CNT2_CNT_29  (0x20000000U << DDRPERFM_CNT2_CNT_Pos) /*!< 0x20000000 */
#define DDRPERFM_CNT2_CNT_30  (0x40000000U << DDRPERFM_CNT2_CNT_Pos) /*!< 0x40000000 */
#define DDRPERFM_CNT2_CNT_31  (0x80000000U << DDRPERFM_CNT2_CNT_Pos) /*!< 0x80000000 */

/****************  Bit definition for DDRPERFM_CNT3 register  *****************/
#define DDRPERFM_CNT3_CNT_Pos (0U)
#define DDRPERFM_CNT3_CNT_Msk (0xFFFFFFFFU << DDRPERFM_CNT3_CNT_Pos) /*!< 0xFFFFFFFF */
#define DDRPERFM_CNT3_CNT     DDRPERFM_CNT3_CNT_Msk                  /*!< event counter value. */
#define DDRPERFM_CNT3_CNT_0   (0x1U << DDRPERFM_CNT3_CNT_Pos)        /*!< 0x00000001 */
#define DDRPERFM_CNT3_CNT_1   (0x2U << DDRPERFM_CNT3_CNT_Pos)        /*!< 0x00000002 */
#define DDRPERFM_CNT3_CNT_2   (0x4U << DDRPERFM_CNT3_CNT_Pos)        /*!< 0x00000004 */
#define DDRPERFM_CNT3_CNT_3   (0x8U << DDRPERFM_CNT3_CNT_Pos)        /*!< 0x00000008 */
#define DDRPERFM_CNT3_CNT_4   (0x10U << DDRPERFM_CNT3_CNT_Pos)       /*!< 0x00000010 */
#define DDRPERFM_CNT3_CNT_5   (0x20U << DDRPERFM_CNT3_CNT_Pos)       /*!< 0x00000020 */
#define DDRPERFM_CNT3_CNT_6   (0x40U << DDRPERFM_CNT3_CNT_Pos)       /*!< 0x00000040 */
#define DDRPERFM_CNT3_CNT_7   (0x80U << DDRPERFM_CNT3_CNT_Pos)       /*!< 0x00000080 */
#define DDRPERFM_CNT3_CNT_8   (0x100U << DDRPERFM_CNT3_CNT_Pos)      /*!< 0x00000100 */
#define DDRPERFM_CNT3_CNT_9   (0x200U << DDRPERFM_CNT3_CNT_Pos)      /*!< 0x00000200 */
#define DDRPERFM_CNT3_CNT_10  (0x400U << DDRPERFM_CNT3_CNT_Pos)      /*!< 0x00000400 */
#define DDRPERFM_CNT3_CNT_11  (0x800U << DDRPERFM_CNT3_CNT_Pos)      /*!< 0x00000800 */
#define DDRPERFM_CNT3_CNT_12  (0x1000U << DDRPERFM_CNT3_CNT_Pos)     /*!< 0x00001000 */
#define DDRPERFM_CNT3_CNT_13  (0x2000U << DDRPERFM_CNT3_CNT_Pos)     /*!< 0x00002000 */
#define DDRPERFM_CNT3_CNT_14  (0x4000U << DDRPERFM_CNT3_CNT_Pos)     /*!< 0x00004000 */
#define DDRPERFM_CNT3_CNT_15  (0x8000U << DDRPERFM_CNT3_CNT_Pos)     /*!< 0x00008000 */
#define DDRPERFM_CNT3_CNT_16  (0x10000U << DDRPERFM_CNT3_CNT_Pos)    /*!< 0x00010000 */
#define DDRPERFM_CNT3_CNT_17  (0x20000U << DDRPERFM_CNT3_CNT_Pos)    /*!< 0x00020000 */
#define DDRPERFM_CNT3_CNT_18  (0x40000U << DDRPERFM_CNT3_CNT_Pos)    /*!< 0x00040000 */
#define DDRPERFM_CNT3_CNT_19  (0x80000U << DDRPERFM_CNT3_CNT_Pos)    /*!< 0x00080000 */
#define DDRPERFM_CNT3_CNT_20  (0x100000U << DDRPERFM_CNT3_CNT_Pos)   /*!< 0x00100000 */
#define DDRPERFM_CNT3_CNT_21  (0x200000U << DDRPERFM_CNT3_CNT_Pos)   /*!< 0x00200000 */
#define DDRPERFM_CNT3_CNT_22  (0x400000U << DDRPERFM_CNT3_CNT_Pos)   /*!< 0x00400000 */
#define DDRPERFM_CNT3_CNT_23  (0x800000U << DDRPERFM_CNT3_CNT_Pos)   /*!< 0x00800000 */
#define DDRPERFM_CNT3_CNT_24  (0x1000000U << DDRPERFM_CNT3_CNT_Pos)  /*!< 0x01000000 */
#define DDRPERFM_CNT3_CNT_25  (0x2000000U << DDRPERFM_CNT3_CNT_Pos)  /*!< 0x02000000 */
#define DDRPERFM_CNT3_CNT_26  (0x4000000U << DDRPERFM_CNT3_CNT_Pos)  /*!< 0x04000000 */
#define DDRPERFM_CNT3_CNT_27  (0x8000000U << DDRPERFM_CNT3_CNT_Pos)  /*!< 0x08000000 */
#define DDRPERFM_CNT3_CNT_28  (0x10000000U << DDRPERFM_CNT3_CNT_Pos) /*!< 0x10000000 */
#define DDRPERFM_CNT3_CNT_29  (0x20000000U << DDRPERFM_CNT3_CNT_Pos) /*!< 0x20000000 */
#define DDRPERFM_CNT3_CNT_30  (0x40000000U << DDRPERFM_CNT3_CNT_Pos) /*!< 0x40000000 */
#define DDRPERFM_CNT3_CNT_31  (0x80000000U << DDRPERFM_CNT3_CNT_Pos) /*!< 0x80000000 */

/****************  Bit definition for DDRPERFM_HWCFG register  ****************/
#define DDRPERFM_HWCFG_NCNT_Pos (0U)
#define DDRPERFM_HWCFG_NCNT_Msk (0xFU << DDRPERFM_HWCFG_NCNT_Pos) /*!< 0x0000000F */
#define DDRPERFM_HWCFG_NCNT     DDRPERFM_HWCFG_NCNT_Msk           /*!< number of counters for this configuration (4) */
#define DDRPERFM_HWCFG_NCNT_0   (0x1U << DDRPERFM_HWCFG_NCNT_Pos) /*!< 0x00000001 */
#define DDRPERFM_HWCFG_NCNT_1   (0x2U << DDRPERFM_HWCFG_NCNT_Pos) /*!< 0x00000002 */
#define DDRPERFM_HWCFG_NCNT_2   (0x4U << DDRPERFM_HWCFG_NCNT_Pos) /*!< 0x00000004 */
#define DDRPERFM_HWCFG_NCNT_3   (0x8U << DDRPERFM_HWCFG_NCNT_Pos) /*!< 0x00000008 */

