ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32MP1xx/stm32mp153axx_cm4.h
/***************  Bit definition for DDRPHYC_DX2DQTR register  ****************/
#define DDRPHYC_DX2DQTR_DQDLY0_Pos (0U)
#define DDRPHYC_DX2DQTR_DQDLY0_Msk (0xFU << DDRPHYC_DX2DQTR_DQDLY0_Pos) /*!< 0x0000000F */
#define DDRPHYC_DX2DQTR_DQDLY0     DDRPHYC_DX2DQTR_DQDLY0_Msk           /*!< DQ delay for bit 0 */
#define DDRPHYC_DX2DQTR_DQDLY0_0   (0x1U << DDRPHYC_DX2DQTR_DQDLY0_Pos) /*!< 0x00000001 */
#define DDRPHYC_DX2DQTR_DQDLY0_1   (0x2U << DDRPHYC_DX2DQTR_DQDLY0_Pos) /*!< 0x00000002 */
#define DDRPHYC_DX2DQTR_DQDLY0_2   (0x4U << DDRPHYC_DX2DQTR_DQDLY0_Pos) /*!< 0x00000004 */
#define DDRPHYC_DX2DQTR_DQDLY0_3   (0x8U << DDRPHYC_DX2DQTR_DQDLY0_Pos) /*!< 0x00000008 */
#define DDRPHYC_DX2DQTR_DQDLY1_Pos (4U)
#define DDRPHYC_DX2DQTR_DQDLY1_Msk (0xFU << DDRPHYC_DX2DQTR_DQDLY1_Pos) /*!< 0x000000F0 */
#define DDRPHYC_DX2DQTR_DQDLY1     DDRPHYC_DX2DQTR_DQDLY1_Msk           /*!< DQ delay for bit 1 */
#define DDRPHYC_DX2DQTR_DQDLY1_0   (0x1U << DDRPHYC_DX2DQTR_DQDLY1_Pos) /*!< 0x00000010 */
#define DDRPHYC_DX2DQTR_DQDLY1_1   (0x2U << DDRPHYC_DX2DQTR_DQDLY1_Pos) /*!< 0x00000020 */
#define DDRPHYC_DX2DQTR_DQDLY1_2   (0x4U << DDRPHYC_DX2DQTR_DQDLY1_Pos) /*!< 0x00000040 */
#define DDRPHYC_DX2DQTR_DQDLY1_3   (0x8U << DDRPHYC_DX2DQTR_DQDLY1_Pos) /*!< 0x00000080 */
#define DDRPHYC_DX2DQTR_DQDLY2_Pos (8U)
#define DDRPHYC_DX2DQTR_DQDLY2_Msk (0xFU << DDRPHYC_DX2DQTR_DQDLY2_Pos) /*!< 0x00000F00 */
#define DDRPHYC_DX2DQTR_DQDLY2     DDRPHYC_DX2DQTR_DQDLY2_Msk           /*!< DQ delay for bit 2 */
#define DDRPHYC_DX2DQTR_DQDLY2_0   (0x1U << DDRPHYC_DX2DQTR_DQDLY2_Pos) /*!< 0x00000100 */
#define DDRPHYC_DX2DQTR_DQDLY2_1   (0x2U << DDRPHYC_DX2DQTR_DQDLY2_Pos) /*!< 0x00000200 */
#define DDRPHYC_DX2DQTR_DQDLY2_2   (0x4U << DDRPHYC_DX2DQTR_DQDLY2_Pos) /*!< 0x00000400 */
#define DDRPHYC_DX2DQTR_DQDLY2_3   (0x8U << DDRPHYC_DX2DQTR_DQDLY2_Pos) /*!< 0x00000800 */
#define DDRPHYC_DX2DQTR_DQDLY3_Pos (12U)
#define DDRPHYC_DX2DQTR_DQDLY3_Msk (0xFU << DDRPHYC_DX2DQTR_DQDLY3_Pos) /*!< 0x0000F000 */
#define DDRPHYC_DX2DQTR_DQDLY3     DDRPHYC_DX2DQTR_DQDLY3_Msk           /*!< DQ delay for bit 3 */
#define DDRPHYC_DX2DQTR_DQDLY3_0   (0x1U << DDRPHYC_DX2DQTR_DQDLY3_Pos) /*!< 0x00001000 */
#define DDRPHYC_DX2DQTR_DQDLY3_1   (0x2U << DDRPHYC_DX2DQTR_DQDLY3_Pos) /*!< 0x00002000 */
#define DDRPHYC_DX2DQTR_DQDLY3_2   (0x4U << DDRPHYC_DX2DQTR_DQDLY3_Pos) /*!< 0x00004000 */
#define DDRPHYC_DX2DQTR_DQDLY3_3   (0x8U << DDRPHYC_DX2DQTR_DQDLY3_Pos) /*!< 0x00008000 */
#define DDRPHYC_DX2DQTR_DQDLY4_Pos (16U)
#define DDRPHYC_DX2DQTR_DQDLY4_Msk (0xFU << DDRPHYC_DX2DQTR_DQDLY4_Pos) /*!< 0x000F0000 */
#define DDRPHYC_DX2DQTR_DQDLY4     DDRPHYC_DX2DQTR_DQDLY4_Msk           /*!< DQ delay for bit 4 */
#define DDRPHYC_DX2DQTR_DQDLY4_0   (0x1U << DDRPHYC_DX2DQTR_DQDLY4_Pos) /*!< 0x00010000 */
#define DDRPHYC_DX2DQTR_DQDLY4_1   (0x2U << DDRPHYC_DX2DQTR_DQDLY4_Pos) /*!< 0x00020000 */
#define DDRPHYC_DX2DQTR_DQDLY4_2   (0x4U << DDRPHYC_DX2DQTR_DQDLY4_Pos) /*!< 0x00040000 */
#define DDRPHYC_DX2DQTR_DQDLY4_3   (0x8U << DDRPHYC_DX2DQTR_DQDLY4_Pos) /*!< 0x00080000 */
#define DDRPHYC_DX2DQTR_DQDLY5_Pos (20U)
#define DDRPHYC_DX2DQTR_DQDLY5_Msk (0xFU << DDRPHYC_DX2DQTR_DQDLY5_Pos) /*!< 0x00F00000 */
#define DDRPHYC_DX2DQTR_DQDLY5     DDRPHYC_DX2DQTR_DQDLY5_Msk           /*!< DQ delay for bit 5 */
#define DDRPHYC_DX2DQTR_DQDLY5_0   (0x1U << DDRPHYC_DX2DQTR_DQDLY5_Pos) /*!< 0x00100000 */
#define DDRPHYC_DX2DQTR_DQDLY5_1   (0x2U << DDRPHYC_DX2DQTR_DQDLY5_Pos) /*!< 0x00200000 */
#define DDRPHYC_DX2DQTR_DQDLY5_2   (0x4U << DDRPHYC_DX2DQTR_DQDLY5_Pos) /*!< 0x00400000 */
#define DDRPHYC_DX2DQTR_DQDLY5_3   (0x8U << DDRPHYC_DX2DQTR_DQDLY5_Pos) /*!< 0x00800000 */
#define DDRPHYC_DX2DQTR_DQDLY6_Pos (24U)
#define DDRPHYC_DX2DQTR_DQDLY6_Msk (0xFU << DDRPHYC_DX2DQTR_DQDLY6_Pos) /*!< 0x0F000000 */
#define DDRPHYC_DX2DQTR_DQDLY6     DDRPHYC_DX2DQTR_DQDLY6_Msk           /*!< DQ delay for bit 6 */
#define DDRPHYC_DX2DQTR_DQDLY6_0   (0x1U << DDRPHYC_DX2DQTR_DQDLY6_Pos) /*!< 0x01000000 */
#define DDRPHYC_DX2DQTR_DQDLY6_1   (0x2U << DDRPHYC_DX2DQTR_DQDLY6_Pos) /*!< 0x02000000 */
#define DDRPHYC_DX2DQTR_DQDLY6_2   (0x4U << DDRPHYC_DX2DQTR_DQDLY6_Pos) /*!< 0x04000000 */
#define DDRPHYC_DX2DQTR_DQDLY6_3   (0x8U << DDRPHYC_DX2DQTR_DQDLY6_Pos) /*!< 0x08000000 */
#define DDRPHYC_DX2DQTR_DQDLY7_Pos (28U)
#define DDRPHYC_DX2DQTR_DQDLY7_Msk (0xFU << DDRPHYC_DX2DQTR_DQDLY7_Pos) /*!< 0xF0000000 */
#define DDRPHYC_DX2DQTR_DQDLY7     DDRPHYC_DX2DQTR_DQDLY7_Msk           /*!< DQ delay for bit 7 */
#define DDRPHYC_DX2DQTR_DQDLY7_0   (0x1U << DDRPHYC_DX2DQTR_DQDLY7_Pos) /*!< 0x10000000 */
#define DDRPHYC_DX2DQTR_DQDLY7_1   (0x2U << DDRPHYC_DX2DQTR_DQDLY7_Pos) /*!< 0x20000000 */
#define DDRPHYC_DX2DQTR_DQDLY7_2   (0x4U << DDRPHYC_DX2DQTR_DQDLY7_Pos) /*!< 0x40000000 */
#define DDRPHYC_DX2DQTR_DQDLY7_3   (0x8U << DDRPHYC_DX2DQTR_DQDLY7_Pos) /*!< 0x80000000 */

/***************  Bit definition for DDRPHYC_DX2DQSTR register  ***************/
#define DDRPHYC_DX2DQSTR_R0DGSL_Pos  (0U)
#define DDRPHYC_DX2DQSTR_R0DGSL_Msk  (0x7U << DDRPHYC_DX2DQSTR_R0DGSL_Pos)  /*!< 0x00000007 */
#define DDRPHYC_DX2DQSTR_R0DGSL      DDRPHYC_DX2DQSTR_R0DGSL_Msk            /*!< Rank 0 DQS gating system latency */
#define DDRPHYC_DX2DQSTR_R0DGSL_0    (0x1U << DDRPHYC_DX2DQSTR_R0DGSL_Pos)  /*!< 0x00000001 */
#define DDRPHYC_DX2DQSTR_R0DGSL_1    (0x2U << DDRPHYC_DX2DQSTR_R0DGSL_Pos)  /*!< 0x00000002 */
#define DDRPHYC_DX2DQSTR_R0DGSL_2    (0x4U << DDRPHYC_DX2DQSTR_R0DGSL_Pos)  /*!< 0x00000004 */
#define DDRPHYC_DX2DQSTR_R0DGPS_Pos  (12U)
#define DDRPHYC_DX2DQSTR_R0DGPS_Msk  (0x3U << DDRPHYC_DX2DQSTR_R0DGPS_Pos)  /*!< 0x00003000 */
#define DDRPHYC_DX2DQSTR_R0DGPS      DDRPHYC_DX2DQSTR_R0DGPS_Msk            /*!< Rank 0 DQS gating phase select */
#define DDRPHYC_DX2DQSTR_R0DGPS_0    (0x1U << DDRPHYC_DX2DQSTR_R0DGPS_Pos)  /*!< 0x00001000 */
#define DDRPHYC_DX2DQSTR_R0DGPS_1    (0x2U << DDRPHYC_DX2DQSTR_R0DGPS_Pos)  /*!< 0x00002000 */
#define DDRPHYC_DX2DQSTR_DQSDLY_Pos  (20U)
#define DDRPHYC_DX2DQSTR_DQSDLY_Msk  (0x7U << DDRPHYC_DX2DQSTR_DQSDLY_Pos)  /*!< 0x00700000 */
#define DDRPHYC_DX2DQSTR_DQSDLY      DDRPHYC_DX2DQSTR_DQSDLY_Msk            /*!< DQS delay */
#define DDRPHYC_DX2DQSTR_DQSDLY_0    (0x1U << DDRPHYC_DX2DQSTR_DQSDLY_Pos)  /*!< 0x00100000 */
#define DDRPHYC_DX2DQSTR_DQSDLY_1    (0x2U << DDRPHYC_DX2DQSTR_DQSDLY_Pos)  /*!< 0x00200000 */
#define DDRPHYC_DX2DQSTR_DQSDLY_2    (0x4U << DDRPHYC_DX2DQSTR_DQSDLY_Pos)  /*!< 0x00400000 */
#define DDRPHYC_DX2DQSTR_DQSNDLY_Pos (23U)
#define DDRPHYC_DX2DQSTR_DQSNDLY_Msk (0x7U << DDRPHYC_DX2DQSTR_DQSNDLY_Pos) /*!< 0x03800000 */
#define DDRPHYC_DX2DQSTR_DQSNDLY     DDRPHYC_DX2DQSTR_DQSNDLY_Msk           /*!< DQS# delay */
#define DDRPHYC_DX2DQSTR_DQSNDLY_0   (0x1U << DDRPHYC_DX2DQSTR_DQSNDLY_Pos) /*!< 0x00800000 */
#define DDRPHYC_DX2DQSTR_DQSNDLY_1   (0x2U << DDRPHYC_DX2DQSTR_DQSNDLY_Pos) /*!< 0x01000000 */
#define DDRPHYC_DX2DQSTR_DQSNDLY_2   (0x4U << DDRPHYC_DX2DQSTR_DQSNDLY_Pos) /*!< 0x02000000 */
#define DDRPHYC_DX2DQSTR_DMDLY_Pos   (26U)
#define DDRPHYC_DX2DQSTR_DMDLY_Msk   (0xFU << DDRPHYC_DX2DQSTR_DMDLY_Pos)   /*!< 0x3C000000 */
#define DDRPHYC_DX2DQSTR_DMDLY       DDRPHYC_DX2DQSTR_DMDLY_Msk             /*!< DM delay */
#define DDRPHYC_DX2DQSTR_DMDLY_0     (0x1U << DDRPHYC_DX2DQSTR_DMDLY_Pos)   /*!< 0x04000000 */
#define DDRPHYC_DX2DQSTR_DMDLY_1     (0x2U << DDRPHYC_DX2DQSTR_DMDLY_Pos)   /*!< 0x08000000 */
#define DDRPHYC_DX2DQSTR_DMDLY_2     (0x4U << DDRPHYC_DX2DQSTR_DMDLY_Pos)   /*!< 0x10000000 */
#define DDRPHYC_DX2DQSTR_DMDLY_3     (0x8U << DDRPHYC_DX2DQSTR_DMDLY_Pos)   /*!< 0x20000000 */

